Repository: oussaki-dev/e5d-assesment
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Total balance
ar: الرصيد الإجمالي

# hello
source: Hello {userName}
ar: مرحبا {userName}

# title_beneficiaries
source: Beneficiaries
ar: المستفيدون

# title_latest_top_ups
source: Latest Top Upâ€™s
ar: التحويلات الأخيرة

# button_add_beneficiary
source: Add beneficiary
ar: إضافة مستفيد

# title_add_new_beneficiary
source: Add a new beneficiary
ar: إضافة مستفيد جديد

# title_beneficiary_nick_name
source: Beneficiary nickname*
ar: إسم المستفيد*

# title_example_mobile
source: Ex: +971 56000000
ar: مثال: +٩٧١٥٦٨٣٣٠٤٤٦

# header_top_up_receipt
source: Top Up Receipt
ar: إيصال تعبئة الرصيد

# header_top_up_success
source: Top Up success
ar: تم تعبئة الرصيد بنجاح

# content_top_up_success
source: Your top up has been successfully done.
ar: لقد تمت عملية تعبئة رصيدك بنجاح.

# title_total_top_up
source: Total top up
ar: إجمالي الرصيد

# title_top_up_destination
source: Top up destination
ar: بيانات المستفيد

source: Done
ar: تم

# label_top_up_money
source: Top up more money
ar: قم بتعبئة المزيد

# button_recharge_now
source: Recharge now
ar: اشحن الآن

# slogan
source: The everyday platform for people at work
ar: منصة كل يوم للعمال

# hint_username
source: Username
ar: إسم المستخدم

# hint_password
source: Password
ar: كلمة المرور

# button_login
source: Login
ar: تسجيل الدخول

# top_up_not_enough_balance
source: You don't have enough balance.
ar: ليس لديك الرصيد الكافي لإجراد هذه المعاملة

# top_up_threshold_one_beneficiary
source: You've exceeded the total monthly threshold to for this beneficiary.
ar: قد تجاوزت الحد الإجمالي لهذا المستفيد

# top_up_already_reached_threshold
source: You've already reached the monthly threshold for this beneficiary
ar: لقد وصلت بالفعل إلى الحد الإجمالي لهذا المستفيد

# top_up_reached_total_threshold
source: You've exceeded the monthly total transactions amount of {amount}
ar: {amount} لقد تجاوزت إجمالي مبلغ المعاملات الشهرية وهو

# error_network_issue
source: Please verify your network connection.
ar: الرجاء التحقق من إتصال الانترنت الخاص بالجهاز

# error_generic
source: Sorry we couldn't serve you now, please try again.
ar: نأسف على عدم تلبية طلبكم الرجاء المحاولة لاحقا.

# top_up_successfuly
source: Top Up successfully
ar: تم تعبئة الرصيد بنججاح

# button_add_beneficiary_success
source: successfully added the beneficiary.
ar: تم إضافة المستفيد بنجاح
